{
  "top": [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "user": [
    {
      "id": 1,
      "name": "admin",
      "email": "admin@world.net",
      "password": "12345678",
      "bookmark": [
        1,
        4,
        9,
        10,
        11,
        5,
        6,
        8
      ]
    },
    {
      "name": "a",
      "email": "elha@ac.comaa",
      "password": "aaaaaa",
      "bookmark": [
        1
      ],
      "id": 2
    }
  ],
  "data": [
    {
      "id": 1,
      "type": "Anime",
      "name": "One Piece",
      "description": "It was a time when pirates ruled the seas. Several bands of pirates were battling over the great hidden treasure, One Piece, which was left by the now legendary pirate captain, Gold Roger. There was a young boy who admired the pirates, his name was Monkey D. Luffy. One day, he mistakenly eats the devil's fruit and turns himself into a rubber human being.\n\nTen years have passed since that incident. Luffy sets out to sail all alone. He sets out to become a great pirate captain and that's when his great adventure begins. \"I'm going to be the Pirate King! I'm going to get One Piece!\". ",
      "count": 961,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/manga/3/55539.jpg"
      },
      "source_id": {
        "myanimelist": "21",
        "anidb": "69"
      }
    },
    {
      "id": 2,
      "type": "Anime",
      "name": "Fullmetal Alchemist: Brotherhood",
      "description": "Two brothers lose their mother to an incurable disease. With the power of alchemy, they use taboo knowledge to resurrect her. The process fails, and as a toll for using this type of alchemy, the older brother, Edward Elric, loses his left leg while the younger brother, Alphonse Elric, loses his entire body. To save his brother, Edward sacrifices his right arm and is able to affix his brother's soul to a suit of armor. With the help of a family friend, Edward receives metal limbs - automail - to replace his lost ones. With that, Edward vows to search for the Philosopher's Stone to return the brothers to their original bodies, even if it means becoming a State Alchemist, one who uses their alchemy for the military.",
      "count": 64,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/1223/96541.jpg"
      },
      "source_id": {
        "myanimelist": "5114",
        "anidb": "6107"
      }
    },
    {
      "id": 3,
      "type": "Anime",
      "name": "Tensei shitara Slime Datta Ken",
      "description": "Lonely thirty-seven-year-old Mikami Satoru is stuck in a dead-end job, unhappy with his mundane life, but after dying at the hands of a robber, he awakens to a fresh start in a fantasy realm...as a slime monster! As he acclimates to his goopy new existence, his exploits with the other monsters set off a chain of events that will change his new world forever!",
      "count": 24,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/1694/93337.jpg"
      },
      "source_id": {
        "myanimelist": "37430",
        "anidb": "13871"
      }
    },
    {
      "id": 4,
      "type": "Anime",
      "name": "One Punch Man",
      "description": "The story takes place in the fictional metropolis of City Z, Japan. The world is full of strange monsters that mysteriously appear and cause many disasters. Saitama is a super powerful hero who easily defeats the monsters and other villains with one punch. However, after becoming too strong, Saitama has become bored with his powers and is always trying to find stronger opponents who can fight him.",
      "count": 12,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/12/76049.jpg"
      },
      "source_id": {
        "myanimelist": "30276",
        "anidb": "11123"
      }
    },
    {
      "id": 5,
      "type": "Anime",
      "name": "Slayers Next",
      "description": "Lina Inverse — the unscrupulous sorceress who steals from the rich and gives to herself! Together with her sword-swinging naive but kind-hearted sidekick, Gouri; her hyper-enthusiastic protégée, Amelia; and the overly-serious golem, Zelgadis; there is nothing Lina cannot do!",
      "count": 26,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/1165/92536.jpg"
      },
      "source_id": {
        "myanimelist": "535",
        "anidb": "95"
      }
    },
    {
      "id": 6,
      "type": "Anime",
      "name": "Gintama",
      "description": "Sakata Gintoki is a samurai living in an era when samurais are no longer needed. To add to his troubles, oppressive aliens have moved in to invade. Gintoki lives with Kagura and Shimura Shinpachi, taking on odd jobs to make the world a better place... and to pay their rent.",
      "count": 201,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/10/73274.jpg"
      },
      "source_id": {
        "myanimelist": "918",
        "anidb": "3468"
      }
    },
    {
      "id": 7,
      "type": "Anime",
      "name": "Overlord",
      "description": "In the year 2138 when virtual reality gaming is booming: Yggdrasil, a popular online game, is quietly shut down one day. However, the protagonist Momonga decides to not log out, and then gets transformed into a powerful skeletal wizard. The world continues to change, with non-player characters (NPCs) beginning to feel emotions. Having no parents, friends, or place in society, this ordinary young man Momonga strives to take over the new world the game has become.",
      "count": 13,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/7/88019.jpg"
      },
      "source_id": {
        "myanimelist": "29803",
        "anidb": "3468"
      }
    },
    {
      "id": 8,
      "type": "Anime",
      "name": "Death Note",
      "description": "Bored with his deteriorating world and the laconic way of his fellows, shinigami Ryuk drops his Death Note on Earth and watches to see if it stirs up anything interesting. His plan succeeds beyond his wildest expectations when the Death Note is found by brilliant high school senior Yagami Light, who is also bored with a world he considers rotten.",
      "count": 37,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/9/9453.jpg"
      },
      "source_id": {
        "myanimelist": "1535",
        "anidb": "4563"
      }
    },
    {
      "id": 9,
      "type": "Anime",
      "name": "Code Geass",
      "description": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.",
      "count": 13,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/5/50331.jpg"
      },
      "source_id": {
        "myanimelist": "1575"
      }
    },
    {
      "id": 10,
      "type": "Anime",
      "name": "Nichijou",
      "description": "Nichijou primarily focuses on the daily antics of a trio of childhood friends—high school girls Mio Naganohara, Yuuko Aioi and Mai Minakami—whose stories soon intertwine with the young genius Hakase Shinonome, her robot caretaker Nano, and their talking cat Sakamoto. With every passing day, the lives of these six, as well as of the many people around them, experience both the calms of normal life and the insanity of the absurd. Walking to school, being bitten by a talking crow, spending time with friends, and watching the principal suplex a deer: they are all in a day's work in the extraordinary everyday lives of those in Nichijou.",
      "count": 26,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/3/75617.jpg"
      },
      "source_id": {
        "myanimelist": "10165"
      }
    },
    {
      "id": 11,
      "type": "Anime",
      "name": "Claymore",
      "description": "When a shapeshifting demon with a thirst for human flesh, known as \"youma,\" arrives in Raki's village, a lone woman with silver eyes walks into town with only a sword upon her back. She is a \"Claymore,\" a being manufactured as half-human and half-youma, for the express purpose of exterminating these monsters. After Raki's family is killed, the Claymore saves his life, but he is subsequently banished from his home. With nowhere else to go, Raki finds the Claymore, known as Clare, and decides to follow her on her journeys.",
      "count": 26,
      "image": {
        "portrait": "https://cdn.myanimelist.net/images/anime/3/21834.jpg"
      },
      "source_id": {
        "myanimelist": "1818"
      }
    }
  ]
}